#+TITLE: Tekton Pipeline : another world without PipelineResources
#+FILETAGS: tekton #work pipeline pipelineresources
#+CATEGORY: tektoncd

This document is a refreshed version of [[https://docs.google.com/document/d/1u6qO7CPtDnTOZMYFQ5ARysSOy8lfFeVw83C_5BxAKsw/edit#heading=h.yc5nzf2ze0dr][A world without PipelineResource]] (only accessible
if you are a member of the tekton community) as of =tekton/pipeline= =v0.17.x=.

* TODO Examples
:LOGBOOK:
CLOCK: [2020-11-10 Tue 16:25]--[2020-11-10 Tue 17:30] =>  1:05
CLOCK: [2020-11-02 Mon 15:37]--[2020-11-09 Mon 16:57] => 169:20
CLOCK: [2020-10-30 Fri 15:10]--[2020-10-30 Fri 16:58] =>  1:48
:END:

The examples in the document are based on the "User stories" list of [[https://docs.google.com/document/d/1h9n0Lod0OiJ_sP2HK8Ms7N04aee5LW8xfz5yMGCFMIs/edit?ts=5f96a3e8#][Tekton Pipeline v1
API]] document.

We are going to use the [[https://github.com/tektoncd/catalog][catalog]] task as much as we can. We are also going to use tekton
bundle, that will be available starting from =v0.18.0=.

